examples/wire_drawing/setup_openfoam/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    dieWall
    {
        type            timeVaryingMappedFixedValue;
	offset		(0 0 0);
	setAverage	off;
        value		uniform (0 0 0);
    }
    outlet
    {
        type            slip;
    }
    inlet
    {
        type            slip;
    }
    Wire
    {
        type            fixedValue;
        value    	uniform (0 0 0);
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}

// ************************************************************************* //
