examples/wire_drawing/setup_openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
	(-3	0.74928616618640	-0.0327145405240020)//0
	(0.5	0.74928616618640	-0.0327145405240020)//1
	(-3	0.91635034447154	-0.0400087200741670)//2
	(0.5	0.75927664840221	-0.0331507343976550)//3

	(-3	0.74928616618640	0.0327145405240020)//4
	(0.5	0.74928616618640	0.0327145405240020)//5
	(-3	0.91635034447154	0.0400087200741670)//6
	(0.5	0.75927664840221	0.0331507343976550)//7

);

blocks
(
    hex (0 1 3 2 4 5 7 6) (100 6 1) simpleGrading (1 1 1)//0
);

edges
(
	polyLine 2 3 ((0.005	0.75927664840221	-0.033150734397655))
	polyLine 6 7 ((0.005	0.75927664840221	0.033150734397655))
);

boundary
(
    dieWall
    {
        type wall;
        faces
        (
            (2 3 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 7 3)
        );
    }
    Wire
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 2 6 4)
        );
    }
    back
    {
	type wedge;
	faces
	(
	    (0 1 3 2)
	);
    }
    front
    {
	type wedge;
	faces
	(
	    (4 6 7 5)
	);
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
