examples/wire_drawing/setup_openfoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libcoconut_timeVaryingMappedCoupledVelocity.so");

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime        0.1;

deltaT          0.1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.2;

functions
{
    PRESSURE_Wire
	{
	 type			surfaceFieldValue;
	 libs			("libfieldFunctionObjects.so");
	 executeControl		timeStep;
	 executeInterval	1;
	 writeControl		timeStep;
	 writeInterval		1;
	 timeFormat		fixed;
	 timePrecision		5;
	 operation		none;
	 writeFields	 	true;
	 surfaceFormat		raw;
	 regionType		patch;
	 name			Wire;
	 fields			(p);		
	}
  
   wallShearStress
       {
 	type			wallShearStress;
	libs			("libfieldFunctionObjects.so");
	executeControl		timeStep;
	executeInterval		1;
	writeControl		timeStep;
	writeInterval		10000000000;
	timeFormat		fixed;
	timeprecision		5;
	log			false;
       }

   TRACTION_Wire
	{
	type			surfaceFieldValue;
	libs			("libfieldFunctionObjects.so");
	executeControl		timeStep;
	executeInterval		1;
	writeControl		timeStep;
	writeInterval		1;
	timeFormat		fixed;
	timePrecision		5;
	operation		none;
	writeFields		true;
	surfaceFormat		raw;
	regionType		patch;
	name			Wire;
	fields			(wallShearStress);
	}

    forces
                 {
                         type forces;
                         libs ("libforces.so");
                         writeControl timeStep;
                         timeInterval 1;
                         log     yes;
                         patches (Wire);
                         rho     rhoInf;
                         log true;
                         rhoInf  1;
                         CofR    (0 0 0);
                  }

}

    

// ************************************************************************* //
